---
kind: property
id: P:Autodesk.Revit.DB.FabricationDimensionDefinition.Type
zh: 类型
source: html/fa5d34d4-d177-fda6-3a96-b557ce970910.htm
---
# Autodesk.Revit.DB.FabricationDimensionDefinition.Type Property

**中文**: 类型

Fabrication dimension type.

## Syntax (C#)
```csharp
public FabricationDimensionType Type { get; }
```